PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_smif_sfdp.c
#define MEMORY_SIZE_16MB                (0x1000000U)

#define CY_SMIF_CHECK_DEVICE_MEMBERS(device)   ((NULL != device->writeEnCmd) || \
                                                (NULL != device->writeDisCmd) || \
                                                (NULL != device->writeDisCmd)|| \
                                                (NULL != device->eraseCmd)|| \
                                                (NULL != device->chipEraseCmd)|| \
                                                (NULL != device->programCmd)|| \
                                                (NULL != device->readStsRegWipCmd))

/***************************************
*     Internal enums
***************************************/
/** Specifies protocol mode. */
typedef enum
{
    PROTOCOL_MODE_1S_1S_1S        = 1U,     /**< One DQ signal used during command transfer,
                                             * address transfer, and data transfer. All phases are SDR.
                                             */
    PROTOCOL_MODE_1S_1S_2S        = 2U,     /**< One DQ signal used during command transfer, and address transfer,
                                             *  two DQ signals used during data transfer. All phases are SDR.
                                             */
    PROTOCOL_MODE_1S_2S_2S        = 3U,     /**< One DQ signal used during command transfer, two DQ signals used
                                             *  during address transfer, and data transfer. All phases are SDR.
                                             */
    PROTOCOL_MODE_1S_1S_4S        = 4U,     /**< One DQ signal used during command and address transfer,
                                             * four DQ signals used during data transfer. All phases are SDR.
                                             */
    PROTOCOL_MODE_1S_4S_4S        = 5U,     /**< One DQ signal used during command transfer, four DQ signals used
                                            * during address transfer, and data transfer. All phases are SDR.
                                            */
#if (CY_IP_MXSMIF_VERSION>=2)
    PROTOCOL_MODE_1S_4D_4D          = 6U,        /**< One DQ signal used during command transfer in single data rate,
                                        * four DQ signals used during address transfer and data transfer in
                                        * double data rate.
                                        */
    PROTOCOL_MODE_1S_1S_8S          = 7U,   /**< One DQ signal used during command and addresstransfer in single data rate,
                                              * eight DQ signals used during data transfer in
                                              * single data rate.
                                             */
    PROTOCOL_MODE_1S_8S_8S          = 8U,   /**< One DQ signal used during command transfer in single data rate,
                                              * eighth DQ signals used during address transfer and data transfer in
                                              * single data rate.
                                             */
    PROTOCOL_MODE_8D_8D_8D          = 9U,   /**< eight DQ signal used during command, address and data transfer in
                                              * double data rate.
                                             */
#endif /* CY_IP_MXSMIF_VERSION */
    PROTOCOL_MODE_WRONG           = 0xFFU   /**< Unknown or unsupported mode */
} cy_en_smif_protocol_mode_t;
/** \endcond */


/***************************************
*     Internal Structures
***************************************/

/**
* This internal structure is used to store data for erase types.
*/
typedef struct
{
    uint8_t eraseCmd;  /**< The instruction used for erase transaction */
    uint32_t eraseSize;    /**< The number of bytes to be erased at one erase transaction */
    uint32_t eraseTime;    /**< The maximum erase time for one erase transaction */
} cy_stc_smif_erase_type_t;


/***************************************
*     Internal Function Prototypes
***************************************/
static cy_en_smif_status_t SfdpReadBuffer(SMIF_Type *base,
        cy_stc_smif_mem_cmd_t const *cmdSfdp,
        uint8_t const sfdpAddress[],
        cy_en_smif_slave_select_t  slaveSelect,
        uint32_t size,
        uint8_t sfdpBuffer[],
        cy_stc_smif_context_t *context);
static uint32_t SfdpFindParameterHeader(uint32_t id, uint8_t const sfdpBuffer[]);
static void SfdpFindParameterTableAddress(uint32_t id,
        uint8_t const sfdpBuffer[],
        uint8_t address[],
        uint8_t *tableLength);
static uint32_t SfdpGetNumOfAddrBytes(uint8_t const sfdpBuffer[], uint32_t memorySize);
static uint32_t SfdpGetMemoryDensity(uint8_t const sfdpBuffer[]);
static void SfdpGetReadCmd_1_4_4(uint8_t const sfdpBuffer[],
                                 cy_stc_smif_mem_cmd_t *cmdRead);
static void SfdpGetReadCmd_1_1_4(uint8_t const sfdpBuffer[],
                                 cy_stc_smif_mem_cmd_t *cmdRead);
static void SfdpGetReadCmd_1_2_2(uint8_t const sfdpBuffer[],
                                 cy_stc_smif_mem_cmd_t *cmdRead);
static void SfdpGetReadCmd_1_1_2(uint8_t const sfdpBuffer[],
                                 cy_stc_smif_mem_cmd_t *cmdRead);
static void SfdpGetReadCmd_1_1_1(uint8_t const sfdpBuffer[],
                                 cy_stc_smif_mem_cmd_t *cmdRead);
static cy_en_smif_protocol_mode_t SfdpGetReadCmdParams(uint8_t const sfdpBuffer[],
        cy_en_smif_data_select_t dataSelect,
        cy_en_smif_txfr_width_t maxDataWidth,
        cy_stc_smif_mem_cmd_t *cmdRead);
static void SfdpGetReadFourBytesCmd(uint8_t const sfdpBuffer[],
                                    cy_en_smif_protocol_mode_t protocolMode,
                                    cy_stc_smif_mem_cmd_t *cmdRead);
static uint32_t SfdpGetPageSize(uint8_t const sfdpBuffer[]);
static uint32_t SfdpGetEraseTime(uint32_t const eraseOffset, uint8_t const sfdpBuffer[], cy_stc_smif_erase_type_t eraseType[]);
static uint32_t SfdpGetChipEraseTime(uint8_t const sfdpBuffer[]);
static uint32_t SfdpGetPageProgramTime(uint8_t const sfdpBuffer[]);
static void SfdpSetWriteEnableCommand(cy_stc_smif_mem_cmd_t* cmdWriteEnable);
static void SfdpSetWriteDisableCommand(cy_stc_smif_mem_cmd_t* cmdWriteDisable);
static void SfdpSetProgramCommand_1_1_1(cy_stc_smif_mem_cmd_t* cmdProgram);
static void SfdpSetProgramCommandFourBytes_1_1_1(cy_stc_smif_mem_cmd_t* cmdProgram);
static void SfdpSetProgramCommandFourBytes_1_1_4(cy_stc_smif_mem_cmd_t* cmdProgram);
static void SfdpSetProgramCommandFourBytes_1_4_4(cy_stc_smif_mem_cmd_t* cmdProgram);
static void SfdpGetProgramFourBytesCmd(uint8_t const sfdpBuffer[],
                                       cy_en_smif_protocol_mode_t protocolMode,
                                       cy_stc_smif_mem_cmd_t *cmdProgram);
static void SfdpSetChipEraseCommand(cy_stc_smif_mem_cmd_t* cmdChipErase);
static uint32_t SfdpGetSectorEraseCommand(cy_stc_smif_mem_device_cfg_t *device,
        uint8_t const sfdpBuffer[],
        cy_stc_smif_erase_type_t eraseTypeStc[]);
static cy_en_smif_status_t SfdpEnterFourByteAddressing(SMIF_Type *base, uint8_t entryMethodByte,
        cy_stc_smif_mem_device_cfg_t *device,
        cy_en_smif_slave_select_t slaveSelect,
        cy_stc_smif_context_t const *context);
static void SfdpGetEraseSizeAndCmd(uint8_t const sfdpBuffer[], cy_stc_smif_erase_type_t eraseType[]);
static cy_en_smif_status_t SfdpPopulateRegionInfo(SMIF_Type *base, uint8_t const sectorMapBuff[],
        uint32_t const buffLength, cy_stc_smif_mem_device_cfg_t *device,
        cy_en_smif_slave_select_t slaveSelect, const cy_stc_smif_context_t *context,
        cy_stc_smif_erase_type_t eraseType[]);
static void SfdpSetWipStatusRegisterCommand(cy_stc_smif_mem_cmd_t* readStsRegWipCmd);

