PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_smif_sfdp.c
/*******************************************************************************
* Function Name: SfdpReadBuffer
****************************************************************************//**
*
* This function reads the tables in the SDFP database into the buffer.
*
* \note This function is a blocking function and blocks until the structure data
* is read and returned. This function uses \ref Cy_SMIF_TransmitCommand()
*
* \param *base
* Holds the base address of the SMIF block registers.
*
* \param *cmdSfdp
*  The command structure to store the Read/Write command
*  configuration.
*
* \param sfdpAddress
* The pointer to an array with the address bytes
* associated with the memory command.
*
* \param slaveSelect
* Denotes the number of the slave device to which the transfer is made.
* (0, 1, 2 or 4 - the bit defines which slave to enable). The two-bit enable
* is possible only for the double quad SPI mode.
*
* \param size
* The size of data to be received. Must be > 0 and not greater than 65536.
*
* \param sfdpBuffer
* The pointer to an array with the SDFP buffer.
*
* \param context
* This is the pointer to the context structure \ref cy_stc_smif_context_t
* allocated by the user. The structure is used during the SMIF
* operation for internal configuration and data retention. The user must not
* modify anything in this structure.
*
* \return A status of the transmission.
*       - \ref CY_SMIF_SUCCESS
*       - \ref CY_SMIF_CMD_FIFO_FULL
*       - \ref CY_SMIF_NO_SFDP_SUPPORT
*       - \ref CY_SMIF_EXCEED_TIMEOUT
*
*******************************************************************************/
static cy_en_smif_status_t SfdpReadBuffer(SMIF_Type *base,
        cy_stc_smif_mem_cmd_t const *cmdSfdp,
        uint8_t const sfdpAddress[],
        cy_en_smif_slave_select_t  slaveSelect,
        uint32_t size,
        uint8_t sfdpBuffer[],
        cy_stc_smif_context_t *context)
{
    cy_en_smif_status_t result = CY_SMIF_NO_SFDP_SUPPORT;

#if (CY_IP_MXSMIF_VERSION ==  1U)
    result = Cy_SMIF_TransmitCommand(base, (uint8_t)cmdSfdp->command,
                                     cmdSfdp->cmdWidth, sfdpAddress, CY_SMIF_SFDP_ADDRESS_LENGTH,
                                     cmdSfdp->addrWidth, slaveSelect, CY_SMIF_TX_NOT_LAST_BYTE,
                                     context);

    if (CY_SMIF_SUCCESS == result)
    {
        result = Cy_SMIF_SendDummyCycles(base, cmdSfdp->dummyCycles);

        if (CY_SMIF_SUCCESS == result)
        {
            result = Cy_SMIF_ReceiveDataBlocking(base,
                                                 sfdpBuffer,
                                                 size,
                                                 cmdSfdp->dataWidth,
                                                 context);
        }
    }
#else
    bool is2byte_command = ((cmdSfdp->cmdWidth == CY_SMIF_WIDTH_OCTAL) && (cmdSfdp->cmdRate ==  CY_SMIF_DDR));
    uint8_t sfdpAddr_4byte[4];

    sfdpAddr_4byte[0] = 0U;

    for (int i = 0; i < 3; i++)
    {
        sfdpAddr_4byte[i + 1] = sfdpAddress[i];
    }

    result = Cy_SMIF_TransmitCommand_Ext(base,
                                         (uint16_t)(cmdSfdp->command | (uint16_t)(cmdSfdp->commandH << 8U)),
                                         is2byte_command, cmdSfdp->cmdWidth, cmdSfdp->cmdRate,
                                         is2byte_command ? sfdpAddr_4byte : sfdpAddress,
                                         is2byte_command ? CY_SMIF_SFDP_ADDRESS_LENGTH + 1U : CY_SMIF_SFDP_ADDRESS_LENGTH,
                                         cmdSfdp->addrWidth, cmdSfdp->addrRate, slaveSelect,
                                         CY_SMIF_TX_NOT_LAST_BYTE, context);

    if (CY_SMIF_SUCCESS == result)
    {
        result = Cy_SMIF_SendDummyCycles_Ext(base, cmdSfdp->addrWidth, cmdSfdp->addrRate, cmdSfdp->dummyCycles);

        if (CY_SMIF_SUCCESS == result)
        {
            result = Cy_SMIF_ReceiveDataBlocking_Ext(base, sfdpBuffer, size,
                     cmdSfdp->dataWidth, cmdSfdp->dataRate,
                     context);
        }
    }

#endif
    return (result);
}


/*******************************************************************************
* Function Name: SfdpFindParameterHeader
****************************************************************************//**
*
* Finds the Parameter Header offset from the JEDEC basic flash parameter table.
*
* \param id
* The parameter ID.
*
* \param sfdpBuffer
* The pointer to an array with the SDFP buffer.
*
* \return The relative parameter header offset in bytes.
*  Returns 0 when the parameter header is not found.
*
*******************************************************************************/
static uint32_t SfdpFindParameterHeader(uint32_t id, uint8_t const sfdpBuffer[])
{
    uint32_t headerOffset = PARAMETER_IS_NOT_FOUND;
    uint32_t maxMinorRevison = 0UL;
    uint32_t sfdpAddress = FIRST_HEADER_OFFSET; /* Begin from 1st Parameter Header */

    while (sfdpAddress <= (((uint32_t)sfdpBuffer[PARAM_HEADERS_NUM] *
                            HEADER_LENGTH) +
                           FIRST_HEADER_OFFSET))
    {
        /* Check parameter ID */
        if (((id & PARAM_ID_LSB_MASK) == sfdpBuffer[sfdpAddress]) &&  /* Parameter ID LSB */
                (((id >> PARAM_ID_MSB_OFFSET) & PARAM_ID_LSB_MASK) ==
                 sfdpBuffer[sfdpAddress +  /* Parameter ID MSB */
                            PARAM_ID_MSB_REL_OFFSET]))
        {
            /* Check parameter major and minor revisions */
            if ((sfdpBuffer[sfdpAddress + PARAM_MINOR_REV_REL_OFFSET] >= maxMinorRevison) &&
                    (sfdpBuffer[sfdpAddress + PARAM_MAJOR_REV_REL_OFFSET] == CY_SMIF_SFDP_MAJOR_REV_1))
            {
                /* Get the maximum minor revision */
                maxMinorRevison = sfdpBuffer[sfdpAddress + PARAM_MINOR_REV_REL_OFFSET];

                /* Save the the Parameter Header offset with the maximum minor revision */
                headerOffset = sfdpAddress;
            }
        }

        sfdpAddress += HEADER_LENGTH;
    }

    return (headerOffset);
}


