PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_smif_sfdp.c
/*******************************************************************************
* Function Name: SfdpFindParameterTableAddress
****************************************************************************//**
*
* Reads the address and length of the Parameter Table from
* the JEDEC basic flash parameter table. If not found, tableLength set to 0.
*
* \param id
* The parameter ID.
*
* \param sfdpBuffer
* The pointer to an array with the SDFP buffer.
*
* \param address
* The Parameter Table address.
*
* \param *tableLength
* The Parameter Table length.
*
*******************************************************************************/
static void SfdpFindParameterTableAddress(uint32_t id,
        uint8_t const sfdpBuffer[],
        uint8_t address[],
        uint8_t *tableLength)
{
    uint32_t headerOffset;

    headerOffset = SfdpFindParameterHeader(id, sfdpBuffer);

    if (PARAMETER_IS_NOT_FOUND != headerOffset)
    {
        /* The Parameter Table address */
        address[2] = sfdpBuffer[headerOffset +
                                PARAM_TABLE_PRT_OFFSET];
        address[1] = sfdpBuffer[headerOffset +
                                PARAM_TABLE_PRT_OFFSET + 1UL];
        address[0] = sfdpBuffer[headerOffset +
                                PARAM_TABLE_PRT_OFFSET + 2UL];

        /* The Parameter Table length */
        *tableLength = (uint8_t)sfdpBuffer[headerOffset + PARAM_TABLE_LENGTH_OFFSET] *
                       BYTES_IN_DWORD;
    }
    else
    {
        *tableLength = 0U;
    }
}


/*******************************************************************************
* Function Name: SfdpGetNumOfAddrBytes
****************************************************************************//**
*
* Reads the number of address bytes from the JEDEC basic flash parameter table.
*
* \note 4-byte addressing mode is set when the memory device supports
*       3- or 4-byte addressing mode and memory density is greater than 16 MB.
*       Otherwise, use 3-byte addressing mode.
*
* \param sfdpBuffer
* The pointer to an array with the SDFP buffer.
*
* \param memorySize
* size of the memory device in bytes.
*
* \return The number of address bytes used by the memory slave device.
*
*******************************************************************************/
static uint32_t SfdpGetNumOfAddrBytes(uint8_t const sfdpBuffer[], uint32_t memorySize)
{
    uint32_t addrBytesNum = 0UL;
    uint32_t sfdpAddrCode = _FLD2VAL(CY_SMIF_SFDP_ADDRESS_BYTES,
                                     (uint32_t)sfdpBuffer
                                     [CY_SMIF_SFDP_BFPT_BYTE_02]);
    switch (sfdpAddrCode)
    {
    case CY_SMIF_SFDP_THREE_BYTES_ADDR_CODE:
        addrBytesNum = CY_SMIF_THREE_BYTES_ADDR;
        break;
    case CY_SMIF_SFDP_THREE_OR_FOUR_BYTES_ADDR_CODE:
        if (memorySize > MEMORY_SIZE_16MB)
        {
            addrBytesNum = CY_SMIF_FOUR_BYTES_ADDR;
        }
        else
        {
            addrBytesNum = CY_SMIF_THREE_BYTES_ADDR;
        }
        break;
    case CY_SMIF_SFDP_FOUR_BYTES_ADDR_CODE:
        addrBytesNum = CY_SMIF_FOUR_BYTES_ADDR;
        break;
    default:
        /* Invalid Address code */
        break;
    }

    return (addrBytesNum);
}


/*******************************************************************************
* Function Name: SfdpGetMemoryDensity
****************************************************************************//**
*
* Reads the Memory Density from the JEDEC basic flash parameter table.
*
* \param sfdpBuffer
* The pointer to an array with the SDFP buffer.
*
* \return The external memory size:
* For densities of 2 gigabits or less - the size in bytes;
* For densities 4 gigabits and above - bit-31 is set to 1b to define that
* this memory is 4 gigabits and above; and other 30:0 bits define N where
* the density is computed as 2^N bytes.
* For example, 0x80000021 corresponds to 2^30 = 1 gigabyte.
*
*******************************************************************************/
static uint32_t SfdpGetMemoryDensity(uint8_t const sfdpBuffer[])
{
    uint32_t memorySize;
    uint32_t locSize = Cy_SMIF_PackBytesArray(&sfdpBuffer[CY_SMIF_SFDP_BFPT_BYTE_04], true);

    if (0UL == (locSize & CY_SMIF_SFDP_SIZE_ABOVE_4GB_Msk))
    {
        memorySize = (locSize + 1UL) / BITS_IN_BYTE;
    }
    else
    {
        memorySize = (locSize - BITS_IN_BYTE_ABOVE_4GB) |
                     CY_SMIF_SFDP_SIZE_ABOVE_4GB_Msk;
    }

    return (memorySize);
}

#if (CY_IP_MXSMIF_VERSION>=2) && defined (SMIF_OCTAL_SFDP_SUPPORT)
/*******************************************************************************
* Function Name: SfdpGetReadCmd_1_8_8
****************************************************************************//**
*
* Reads the FAST_READ_1_8_8 read command parameters from the JEDEC basic flash
* parameter table.
*
* \param sfdpBuffer
* The pointer to an array with the SDFP buffer.
*
* \param cmdRead
* The pointer to the read command parameters structure.
*
*******************************************************************************/
static void SfdpGetReadCmd_1_8_8(uint8_t const sfdpBuffer[],
                                 cy_stc_smif_mem_cmd_t *cmdRead)
{
    /* 8-bit command. 8 x I/O Read command */
    cmdRead->command = sfdpBuffer[CY_SMIF_SFDP_BFPT_BYTE_41];

    /* command presence - 1 byte transfer */
    cmdRead->cmdPresence = CY_SMIF_PRESENT_1BYTE;

    /* The command transfer width */
    cmdRead->cmdWidth = CY_SMIF_WIDTH_SINGLE;

    /* The address transfer width */
    cmdRead->addrWidth = CY_SMIF_WIDTH_OCTAL;

    /* The 8-bit mode byte. This value is 0xFFFFFFFF when there is no mode present */
    if (0U == (_FLD2VAL(CY_SMIF_SFDP_1_8_8_MODE_CYCLES,
                        (uint32_t) sfdpBuffer[CY_SMIF_SFDP_BFPT_BYTE_40])))
    {
        cmdRead->mode = CY_SMIF_NO_COMMAND_OR_MODE;
    }
    else
    {
        cmdRead->mode = READ_ENHANCED_MODE_DISABLED;
        cmdRead->modeWidth = CY_SMIF_WIDTH_OCTAL;
        cmdRead->modePresence = CY_SMIF_PRESENT_1BYTE;
    }

    /* The dummy cycles number. A zero value suggests no dummy cycles */
    cmdRead->dummyCycles = _FLD2VAL(CY_SMIF_SFDP_1_8_8_DUMMY_CYCLES,
                                    (uint32_t) sfdpBuffer[CY_SMIF_SFDP_BFPT_BYTE_40]);

