PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_smif_sfdp.c
        /* Get the number of latency cycles required for configuration detection command */
        dummyCycles = (uint8_t) _FLD2VAL(CY_SMIF_SFDP_SECTOR_MAP_DUMMY_CYCLES, sectorMapBuff[currTableIdx + CY_SMIF_SFDP_SECTOR_MAP_ADDR_LEN_OFFSET]);

        /* If variable latency is detected use 8 cycles as serial flash repeats RX data in case 0 dummy cycles required */
        if (dummyCycles == 0xFU)
        {
            dummyCycles = 8U;
        }

        /* Read the value of the register for the current configuration detection */
        result = ReadAnyReg(base, slaveSelect, &regValue, currCmd, dummyCycles, &currRegisterAddr[0], addrBytesNum, context);

        if (CY_SMIF_SUCCESS == result)
        {
            /* Set the bit of the region idx to 1 if the config matches */
            regionInfoIdx = ((uint8_t)(regionInfoIdx << 1U)) | (((regValue & regMask) == 0U) ? (0U) : (1U));
        }

        currTableIdx += HEADER_LENGTH;
        if (currTableIdx > buffLength)
        {
            result = CY_SMIF_SFDP_CORRUPTED_TABLE;
            break;
        }
    }

    if (CY_SMIF_SUCCESS == result)
    {
        /* Find the matching configuration map descriptor */
        while (regionInfoIdx != sectorMapBuff[currTableIdx + 1UL])
        {
            /* Increment the table index to the next map */
            currTableIdx += (sectorMapBuff[currTableIdx + CY_SMIF_SFDP_SECTOR_MAP_CONFIG_ID_OFFSET] + 2UL) * BYTES_IN_DWORD;
            if (currTableIdx > buffLength)
            {
                result = CY_SMIF_SFDP_CORRUPTED_TABLE;
                break;
            }
        }
    }

    if (CY_SMIF_SUCCESS == result)
    {
        /* Populate region data from the sector map */
        uint8_t numOfRegions = sectorMapBuff[currTableIdx + CY_SMIF_SFDP_SECTOR_MAP_REGION_COUNT_OFFSET] + 1U;
        device->hybridRegionCount = (uint32_t) numOfRegions;

        if (numOfRegions < 1U)
        {
            result = CY_SMIF_NOT_HYBRID_MEM;
        }
        else
        {
            uint8_t eraseTypeCode;
            uint32_t currRegionAddr = 0UL;
            uint32_t regionSize = 0UL;
            uint8_t supportedEraseType;
            uint8_t eraseTypeMask;
            cy_stc_smif_hybrid_region_info_t *currRegionPtr;
            for (uint8_t currRegion = 0U; currRegion < numOfRegions; currRegion++)
            {
                currRegionAddr = currRegionAddr + regionSize;
                currTableIdx += BYTES_IN_DWORD;

                supportedEraseType = 0U;
                eraseTypeMask = 1U;
                eraseTypeCode = sectorMapBuff[currTableIdx] & CY_SMIF_SFDP_SECTOR_MAP_SUPPORTED_ET_MASK;
                while (0U == (eraseTypeCode & eraseTypeMask))
                {
                    /* Erase type number defined as a bit position */
                    eraseTypeMask = eraseTypeMask << 1;
                    supportedEraseType++;
                    if (supportedEraseType > ERASE_TYPE_COUNT)
                    {
                        result = CY_SMIF_SFDP_CORRUPTED_TABLE;
                        break;
                    }
                }

                /* The region size as a zero-based count of 256 byte units */
                regionSize = ((*((uint32_t*) &sectorMapBuff[currTableIdx]) >> BITS_IN_BYTE) + 1UL) * SECTOR_MAP_REGION_SIZE_MULTIPLIER;
                CY_MISRA_BLOCK_END('MISRA C-2012 Rule 11.3')
                currRegionPtr = device->hybridRegionInfo[currRegion];

                currRegionPtr->regionAddress = currRegionAddr;
                currRegionPtr->eraseCmd = (uint32_t)eraseType[supportedEraseType].eraseCmd;
                currRegionPtr->eraseTime = eraseType[supportedEraseType].eraseTime;
                if (regionSize < eraseType[supportedEraseType].eraseSize)
                {
                    /* One region with a single sector */
                    currRegionPtr->eraseSize = regionSize;
                    currRegionPtr->sectorsCount = 1UL;
                }
                else
                {
                    currRegionPtr->eraseSize = eraseType[supportedEraseType].eraseSize;
                    currRegionPtr->sectorsCount = regionSize / eraseType[supportedEraseType].eraseSize;
                }
            }
        }
    }
    return result;
}

#if (CY_IP_MXSMIF_VERSION>=2) && defined(SMIF_OCTAL_SFDP_SUPPORT)
static cy_en_smif_protocol_mode_t GetOctalSDRParams(SMIF_Type *base,
        uint8_t sfdpBuffer[],
        cy_stc_smif_mem_device_cfg_t *device,
        cy_en_smif_slave_select_t slaveSelect,
        uint32_t sfdpForBytesTableDword1,
        uint8_t *sccrMapAddr,
        uint8_t  sccrMapTableLength,
        cy_stc_smif_context_t *context)
{
    cy_en_smif_protocol_mode_t protocol = PROTOCOL_MODE_WRONG;
    cy_en_smif_status_t result = CY_SMIF_NO_OE_BIT;
    cy_stc_smif_mem_cmd_t *cmdSfdp = device->readSfdpCmd;
    cy_stc_smif_mem_cmd_t *cmdRead = device->readCmd;

    CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 11.3', 'Pointer type conversion is intentional.');

    if (_FLD2BOOL(SUPPORT_FAST_READ_1S_8S_8S_CMD,
                  sfdpForBytesTableDword1))
    {
        SfdpGetReadCmd_1_8_8(sfdpBuffer, cmdRead);
        protocol = PROTOCOL_MODE_1S_8S_8S;
    }
    else if (_FLD2BOOL(SUPPORT_FAST_READ_1S_1S_8S_CMD,
                       sfdpForBytesTableDword1))
    {
        SfdpGetReadCmd_1_1_8(sfdpBuffer, cmdRead);
        protocol = PROTOCOL_MODE_1S_1S_8S;
    }
    else
    {
        /* Do Nothing */
    }

    if (protocol != PROTOCOL_MODE_WRONG)
    {
        /* Get Octal Enable commands and mask */
        uint8_t sccrMapAddrBuffer[CY_SMIF_SFDP_LENGTH];

        /* Get the JEDEC SCCR Map Table content into sfdpBuffer[] */
        result = SfdpReadBuffer(base, cmdSfdp, sccrMapAddr, slaveSelect,
                                sccrMapTableLength, sccrMapAddrBuffer, context);

        if (result == CY_SMIF_SUCCESS)
        {
            /* Get the mask which contains the Support for Fast Read Commands
             * from SCCR Map Table, DWORD 16
             */
            CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 11.3', 'Pointer type conversion is intentional.');
            uint32_t sccrMapAddrBufferDword16 = (*(uint32_t*)&sccrMapAddrBuffer[CY_SMIF_SFDP_SCCR_MAP_BYTE_3B]);

