PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_smif_sfdp.c
                            device->programCmd->commandH = device->programCmd->command;
                            device->programCmd->cmdWidth = CY_SMIF_WIDTH_OCTAL;
                            device->programCmd->cmdRate = CY_SMIF_DDR;
                            device->programCmd->cmdPresence = CY_SMIF_PRESENT_2BYTE;
                            device->programCmd->addrWidth = CY_SMIF_WIDTH_OCTAL;
                            device->programCmd->addrRate = CY_SMIF_DDR;
                            device->programCmd->dataWidth = CY_SMIF_WIDTH_OCTAL;
                            device->programCmd->dataRate = CY_SMIF_DDR;
                        }
#endif
                    }
                }
                else /* Four Byte addressing not supported by the part */
                {
                    /* The program command for 3-byte addressing mode */
                    SfdpSetProgramCommand_1_1_1(device->programCmd);

                    /* Find the sector Erase command type with 3-byte addressing */
                    eraseTypeOffset = SfdpGetSectorEraseCommand(device, sfdpBuffer, eraseType);
                }

                if (COMMAND_IS_NOT_FOUND != eraseTypeOffset)
                {
                    /* The Erase sector size (from the JEDEC basic flash parameter table) */
                    device->eraseSize = 0x01UL << sfdpBuffer[eraseTypeOffset - 1UL];

                    if (sfdp_minor_revision != CY_SMIF_SFDP_JEDEC_REV_0)
                    {
                        /* Erase Time Type (from the JEDEC basic flash parameter table) */
                        device->eraseTime = SfdpGetEraseTime(eraseTypeOffset, sfdpBuffer, eraseType);
                    }
                    else
                    {
                        device->eraseTime = CY_SMIF_SFDP_ERASE_TIME_1S;
                    }
                }

                if (NULL != device->hybridRegionInfo)
                {
                    /* Get the Sector Map Parameter Table into sfdpBuffer[] */
                    result = SfdpReadBuffer(base, cmdSfdp, sectorMapAddr, slaveSelect,
                                            sectorMapTableLength, sfdpBuffer, context);
                    if (CY_SMIF_SUCCESS == result)
                    {
                        result = SfdpPopulateRegionInfo(base, sfdpBuffer, sectorMapTableLength, device, slaveSelect, context, eraseType);
                        if (result == CY_SMIF_NOT_HYBRID_MEM)
                        {
                            device->hybridRegionCount = 0UL;
                            device->hybridRegionInfo = NULL;
                            result = CY_SMIF_SUCCESS;
                        }
                    }
                }
            }
        }
        else
        {
            result = CY_SMIF_NO_SFDP_SUPPORT;
        }
    }
    else
    {
        result = CY_SMIF_NO_SFDP_SUPPORT;
    }

    /* XIP and Device Register initialization */
    if ((CY_SMIF_SUCCESS == result) &&
            (0U != (memCfg->flags & CY_SMIF_FLAG_MEMORY_MAPPED)) &&
            (_FLD2VAL(SMIF_CTL_XIP_MODE, SMIF_CTL(base)) != 1U))
    {
        /* Check valid parameters for XIP */
        CY_ASSERT_L3(MEM_ADDR_VALID(memCfg->baseAddress, memCfg->memMappedSize));
        CY_ASSERT_L3(MEM_MAPPED_SIZE_VALID(memCfg->memMappedSize));
        SMIF_DEVICE_Type volatile * device_base = Cy_SMIF_GetDeviceBySlot(base, slaveSelect);

        if (device_base != NULL)
        {
            XipRegInit(device_base, memCfg);

#if(CY_IP_MXSMIF_VERSION>=2)
            context->preXIPDataRate = memCfg->deviceCfg->readCmd->dataRate;
#endif /* CY_IP_MXSMIF_VERSION */
        }

        /* The device control register initialization */
        SMIF_DEVICE_CTL(device_base) = _VAL2FLD(SMIF_DEVICE_CTL_WR_EN, ((bool)(memCfg->flags & CY_SMIF_FLAG_WRITE_ENABLE)) ? 1U : 0U) |
                                       _VAL2FLD(SMIF_DEVICE_CTL_CRYPTO_EN, ((bool)(memCfg->flags & CY_SMIF_FLAG_CRYPTO_ENABLE)) ? 1U : 0U) |
                                       _VAL2FLD(SMIF_DEVICE_CTL_DATA_SEL, (uint32_t)memCfg->dataSelect) |
#if(CY_IP_MXSMIF_VERSION>=2)
                                       _VAL2FLD(SMIF_DEVICE_CTL_MERGE_EN, ((bool)(memCfg->flags & CY_SMIF_FLAG_MERGE_ENABLE)) ? 1U : 0U)  |
                                       _VAL2FLD(SMIF_DEVICE_CTL_MERGE_TIMEOUT, (uint32_t)memCfg->mergeTimeout) |
#endif /* CY_IP_MXSMIF_VERSION */
                                       SMIF_DEVICE_CTL_ENABLED_Msk;
    }

    Cy_SysLib_ExitCriticalSection(interruptState);

    return (result);
}
/*******************************************************************************
* Function Name: Cy_SMIF_MemSfdpDetect
****************************************************************************//**
*
* This function detects the device signature for SFDP devices.
* Refer to the SFDP spec (JESD216B) for details.
* The function asks the device using an SPI and then populates the relevant
* parameters for \ref cy_stc_smif_mem_device_cfg_t.
*
* \note This function is a blocking function and blocks until the structure data
* is read and returned. This function uses \ref Cy_SMIF_TransmitCommand()
* If there is no support for SFDP in the memory device, the API returns an
* error condition. The function requires:
*   - SMIF initialized and enabled to work in the normal mode;
*   - readSfdpCmd field of \ref cy_stc_smif_mem_device_cfg_t is enabled.
*
* \note The SFDP detect takes into account the types of the SPI supported by the
* memory device and also the dataSelect option selected to choose which SPI mode
* (SPI, DSPI, QSPI, OSPI) to load into the structures. The algorithm prefers
* OSPI>QSPI>DSPI>SPI, provided there is support for it in the memory device and the
* dataSelect selected by the user. Similarly for data rate, DDR is preferred over SDR
* if the memory part supports.
*
* \note 4-byte addressing mode is set when the memory device supports
*       3- or 4-byte addressing mode.
*
* \note When the Erase command is not found the width of the command
*  transfer (cmdWidth) is set to CY_SMIF_WIDTH_NA. When the Program command
*  is not found for 4 byte addressing mode the Program command instruction
*  is set for 1S-1S-1S Protocol mode and 3-byte addressing mode.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param device
* The device structure instance declared by the user. This is where the detected
* parameters are stored and returned.
*
* \param slaveSelect
* The slave select line for the device.
*
* \param dataSelect
* The data line selection options for a slave device.
*
* \param context
* This is the pointer to the context structure \ref cy_stc_smif_context_t
* allocated by the user. The structure is used during the SMIF
* operation for internal configuration and data retention. The user must not
* modify anything in this structure.
*
* \return A status of the transmission.
*       - \ref CY_SMIF_SUCCESS
*       - \ref CY_SMIF_CMD_FIFO_FULL
*       - \ref CY_SMIF_NO_SFDP_SUPPORT
*       - \ref CY_SMIF_EXCEED_TIMEOUT
*
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_MemSfdpDetect(SMIF_Type *base,
        cy_stc_smif_mem_device_cfg_t *device,
        cy_en_smif_slave_select_t slaveSelect,
        cy_en_smif_data_select_t dataSelect,
        cy_stc_smif_context_t *context)
{

    /* Check the input parameters */
    CY_ASSERT_L1(NULL != device);

    cy_stc_smif_mem_config_t memSfdpDetect =
    {
        .slaveSelect = slaveSelect,
        .flags = 0,
        .dataSelect = dataSelect,
        .baseAddress = 0U,
        .memMappedSize = 0U,
        .dualQuadSlots = 0,
        .deviceCfg = device,
#if (CY_IP_MXSMIF_VERSION >= 3)
        .mergeTimeout = CY_SMIF_MERGE_TIMEOUT_1_CYCLE
#endif /* CY_IP_MXSMIF_VERSION */
    };

    return Cy_SMIF_MemInitSfdpMode(base, &memSfdpDetect, CY_SMIF_WIDTH_OCTAL, CY_SMIF_SFDP_QER_0, context);
}

#if defined(__cplusplus)
}
#endif

#endif /* CY_IP_MXSMIF */

/* [] END OF FILE */
